#include <stdio.h>
#include <stdlib.h>
#include <locale.h>
#include "seller.h"
#include "сlient.h"

void output_str_1(int loc,char cat1[20],char cat2[20]){
    //system("clear"); //system("cls"); in windows
    setlocale(LC_ALL, "Russian");
    if (loc == 0){
        printf("==============================================================================================\n");
        printf("==    Покупатель  =                                                                         ==\n");
        printf("==============================================================================================\n");
    };
    if (loc == 1){
        printf("==============================================================================================\n");
        printf("==    Покупатель    =    %-20s    ==                                                   ==\n",cat1);
        printf("==============================================================================================\n");
    };
    if (loc == 2){
        printf("==============================================================================================\n");
        printf("==    Покупатель    ==    %-20s    ==    %-20s    ==                               ==\n",cat1,cat2);
        printf("==============================================================================================\n");
    };
}
void output_str_2(char number[2],int loc1,char name[25],char cost[2]){
    setlocale(LC_ALL, "Russian");
    if (loc1 == 1){
        printf("== %-2s) =  %-25s                                                             ==\n",number,name);
    };
    if (loc1 == 2){
        printf("== %-2s) =  %-25s                                                =  %-4s руб.  ==\n",number,name,cost);
    };
}
char output_str_3(void){

    return 0;
}
char input_str_2(void){
    char input;
    setlocale(LC_ALL, "Russian");
    printf("==============================================================================================\n");
    printf("==      Введите число: ");scanf("%c",&input);printf("                                                                    ==\n");
    printf("==============================================================================================\n");
    return input;
}
