#include <stdio.h>
#include <stdlib.h>
#include <locale.h>
#include <windows.h>
#include "seller.h"

void output_str_1(int loc,char cat1[1]){
    setlocale(LC_ALL, "Russian");
    int i=0;
    if (loc == 0){
        printf("================================================================================\n");
        printf("==                              ®ªγ― β¥«μ                                    ==\n");
        printf("================================================================================\n");
    }
    char* category[]={" β¥£®ΰ¨¨",           //0
                      "‘ ­¤Ά¨η¨",            //1
                      " ΰβ®δ¥«μ ¨ αβ ΰβ¥ΰλ",//2
                      "‘ « βλ ¨ ΰ®««λ",      //3
                      "„¥α¥ΰβλ ¨ Άλ―¥ηª ",   //4
                      " ―¨βª¨ ¨ ª®ªβ¥©«¨",  //5
                      "®δ¥, η ©",           //6
                      "‘®γαλ",               //7
                      " ª‡ Άβΰ ª",          //8
                      "„ΰγ£¨¥ ―ΰ®¤γªβλ"};    //9
    switch(cat1[0]){
      case('1'): i=1;break;
      case('2'): i=2;break;
      case('3'): i=3;break;
      case('4'): i=4;break;
      case('5'): i=5;break;
      case('6'): i=6;break;
      case('7'): i=7;break;
      case('8'): i=8;break;
      case('9'): i=9;break;
    }
    if (loc == 1){
        printf("================================================================================\n");
        printf("==    ®ªγ― β¥«μ    =    %-20s    ==                                          ==\n",category[i]);
        printf("================================================================================\n");
    }
}

void output_str_2(int number,char name[25],char cost1[4],char cost2[4]){
    setlocale(LC_ALL, "Russian");

    if (cost2[0] != '0'){
        printf("== %-2d) =  %-25s                                                =  %-4s  ΰγ΅.  ==\n",number,name,cost1);
    }
    if (cost2[0] == '0'){
        printf("== %-2d) =  %-25s                                         =  %-4s / %-4s ΰγ΅.  ==\n",number,name,cost1,cost2);
    }
}

void logo(void){
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
        setlocale(LC_ALL,"Russian");
    printf("================================================================================\n");
    printf("=°°²²²²²²°°²²²²²²°°¨ªβ® ­¥ ¬®¦¥β α¤¥« βμ νβ® β ª,°°°°°°°°°°°°°°°°°°°°°°°°°°°°°=\n");
    printf("=°²²°°°°°²²°°°°°²²°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°ª ª νβ® ¤¥« ¥β McDonald?s°°°°=\n");
    printf("=°²²°°°°°²²°°°°°²²°°°°°°°²²²²²°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°1979£.°=\n");
    printf("=°²²°°°°°²²°°°°°²²°°²²²°°²²°°²°°²²²²°°²²²²°°°°²²²²°²²°°°°²²²²²°²²°°²²²²²°°°°°°°=\n");
    printf("=°²²°°°°°²²°°°°°²²°²²°°°°²²°°²°²²°°²²°²²°²²°²²°°²²°²²°°°°²²°°²°°²°²²°°°²²°°°°°°=\n");
    printf("=°²²°°°°°²²°°°°°²²°²²°°°°²²°°²°²²°°²²°²²°²²°²²°°²²°²²°°°°²²°°²°°°°°°²²°°°°°°°°°=\n");
    printf("=°²²°°°°°²²°°°°°²²°²²°°°°²²°°²°²²°°²²°²²°²²°²²²²²²°²²°°°°²²°°²°°°²²°°°²²°°°°°°°=\n");
    printf("=°²²°°°°°²²°°°°°²²°°²²²°°²²²²²°°²²²²°°²²°²²°²²°°²²°²²²²²°²²²²²°°°°²²²²²°°°°°°°°=\n");
    printf("================================================================================\n");
}

char input_str_2(void){
    char input;
    setlocale(LC_ALL, "Russian");
    printf("================================================================================\n");
    printf("==      ‚Ά¥¤¨β¥ η¨α«®: ");
    scanf("%c",&input);printf("                                                      ==\n");
    printf("================================================================================\n");
    return input;
}

char gui(void){
    system("cls"); //system("cls"); in windows
    char input;
    logo();
    printf("==                             McDonald?s                                     ==\n");
    printf("==                      ‚λ΅¨ΰ¨β¥ ®¤¨­ ¨§ Ά ΰ¨ ­β®Ά                            ==\n");
    printf("==                    1)‘®βΰγ¤­¨ª                                             ==\n");
    printf("==                    2)®ªγ― β¥«μ                                            ==\n");
    printf("==                    0)‚λε®¤                                                 ==\n");
    input=input_str_2();
    return input;
}

void gui_chouse_cat(void){
    system("cls"); //system("cls"); in windows
    logo();
    printf("==                       ‚λ΅¨ΰ¥β¥ ­γ¦­γξ ª β¥£®ΰ¨ξ                            ==\n");
    printf("==  1)‘ ­¤Ά¨η¨                6)®δ¥, η ©                                     ==\n");
    printf("==  2) ΰβ®δ¥«μ ¨ αβ ΰβ¥ΰλ    7)‘®γαλ                                         ==\n");
    printf("==  3)‘ « βλ ¨ ΰ®««λ          8) ª‡ Άβΰ ª                                    ==\n");
    printf("==  4)„¥α¥ΰβλ ¨ Άλ―¥ηª        9)„ΰγ£¨¥ ―ΰ®¤γªβλ                               ==\n");
    printf("==  5) ―¨βª¨ ¨ ª®ªβ¥©«¨      !)‚λε®¤ Ά ¬¥­ξ Άλ΅®ΰ  ―®«μ§®Ά β¥«ο              ==\n");
}
